org/2020-06-06-code-smells.org
#+TITLE: Idiomatic Clojure: Code Smells

#+OPTIONS: toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: post
title: "Idiomatic Clojure: Code Smells"
permalink: /:title/
tags: [clojure, "idiomatic clojure" ,"code smells"]
categories: [clojure, "idiomatic clojure", "code smells"]
---
#+END_EXPORT

We all make mistakes. We have all written bad pieces of code at some
point of our lives. They might have been non-idiomatic, unreadable, or
had bad performance.

This post catalogs all the little things which sit down at the bottom of
your code, accumulate like dust, and when taken in as a whole, clog down
the code base. It's important to remember code is read more than it is
edited, and is not only a way for us to communicate with the computer,
but with other programmers (including ourselves in the future).

Hopefully the advice in this post will help you recognize all those
little code smells and write more readable, maintainable code.

Happy hacking.

* Mapping

** ~mapcat~ To The Rescue

   Sometimes you need to concat the results of mapping. Using ~mapcat~
   is an idiomatic option for this case:

   #+begin_src clojure
     ;;; Don't                       Do
     (apply concat (map f xs))  =>  (mapcat xs)
   #+end_src

** What Is It For?

   Avoid trivial ~for~ (list comprehensions)

   #+begin_src clojure
     ;;; Don't                Do
     (for [x xs] (f x))  =>  (map f xs)
   #+end_src

   And yes, I've seen a combination of both:

   #+begin_src clojure
     ;;; Please Don't
     (apply concat (for [x xs] (f x)))
   #+end_src

** Trivial Lambda

   There's no reason to wrap a function in an anonymous function:

   #+begin_src clojure
     ;;; Don't             Do
     (map #(f %) xs)  =>  (map f xs)
   #+end_src

** Realize When Collections Want To Be Associative
   
   If you find yourself scanning collections of maps looking for a map
   where a certain key has a certain value, your collection might be
   telling you it wants to be associative, not sequential:
   
   #+begin_src clojure
     (def people
       [{:person/name "Fred"}
        {:person/name "Ethel"}
        {:person/name "Lucy"}])

     (defn person-in-people?
       [person people]
       (some #(= person (:person/name %)) people))

     (person-in-people? "Fred" people);; => true
     (person-in-people? "Bob" people) ;; => nil

   #+end_src
   
   Instead, index the collection according to the parameter which
   interests you:
   
   #+begin_src clojure
     (def collected-people
       (clojure.set/index people [:person/name]))

     (contains? collected-people {:person/name "Fred"});; => true
     (contains? collected-people {:person/name "Bob"}) ;; => false
   #+end_src
   
   This code is readable: "Does ~collected-people~ contain a person
   who's name is Bob?".

   You can also index it yourself:
   #+begin_src clojure
     (defn index
       [xs k]
       (reduce
        (fn [m x]
          (let [ik (get x k)]
            (assoc m ik (conj (get m ik #{}) x)))) {} xs))

     (def collected-people
       (index people :person/name))

     (contains? collected-people "Fred");; => true
     (contains? collected-people "Bob") ;; => false
   #+end_src
   
   If you repeatedly filter according to certain attributes, you might
   want to index according to them, too, with ~group-by~ or
   ~clojure.set/index~.

   An important distinction between group-by and index, is that group-by
   indexes according to a function, so you can presumably bin values as
   well, for example, by age or height, while index works specifically
   with keys.

