_posts/2020-06-06-code-smells.html
---
layout: post
title: "Idiomatic Clojure: Code Smells"
permalink: /:title/
tags: [clojure, "idiomatic clojure" ,"code smells"]
categories: [clojure, "idiomatic clojure", "code smells"]
---

<p>
We all make mistakes. We have all written bad pieces of code at some
point of our lives. They might have been non-idiomatic, unreadable, or
had bad performance.
</p>

<p>
This post catalogs all the little things which sit down at the bottom of
your code, accumulate like dust, and when taken in as a whole, clog down
the code base. It's important to remember code is read more than it is
edited, and is not only a way for us to communicate with the computer,
but with other programmers (including ourselves in the future).
</p>

<p>
Hopefully the advice in this post will help you recognize all those
little code smells and write more readable, maintainable code.
</p>

<p>
Happy hacking.
</p>

<div id="outline-container-orgf4df3d6" class="outline-2">
<h2 id="orgf4df3d6">Mapping</h2>
<div class="outline-text-2" id="text-orgf4df3d6">
</div>
<div id="outline-container-org5a51028" class="outline-3">
<h3 id="org5a51028"><code>mapcat</code> To The Rescue</h3>
<div class="outline-text-3" id="text-org5a51028">
<p>
Sometimes you need to concat the results of mapping. Using <code>mapcat</code>
is an idiomatic option for this case:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't                       Do</span>
<span style="color: #3a81c3;">(</span>apply concat <span style="color: #6c3163;">(</span>map f xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>mapcat xs<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ce1284" class="outline-3">
<h3 id="org7ce1284">What Is It For?</h3>
<div class="outline-text-3" id="text-org7ce1284">
<p>
Avoid trivial <code>for</code> (list comprehensions)
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't                Do</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">for</span> <span style="color: #6c3163;">[</span>x xs<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span>f x<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>map f xs<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
And yes, I've seen a combination of both:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Please Don't</span>
<span style="color: #3a81c3;">(</span>apply concat <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">for</span> <span style="color: #2d9574;">[</span>x xs<span style="color: #2d9574;">]</span> <span style="color: #2d9574;">(</span>f x<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4b502a9" class="outline-3">
<h3 id="org4b502a9">Trivial Lambda</h3>
<div class="outline-text-3" id="text-org4b502a9">
<p>
There's no reason to wrap a function in an anonymous function:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't             Do</span>
<span style="color: #3a81c3;">(</span>map #<span style="color: #6c3163;">(</span>f <span style="color: #715ab1;">%</span><span style="color: #6c3163;">)</span> xs<span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>map f xs<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org26c795e" class="outline-3">
<h3 id="org26c795e">Realize When Collections Want To Be Associative</h3>
<div class="outline-text-3" id="text-org26c795e">
<p>
If you find yourself scanning collections of maps looking for a map
where a certain key has a certain value, your collection might be
telling you it wants to be associative, not sequential:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">people</span>
  <span style="color: #6c3163;">[</span><span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">person</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">name</span> <span style="color: #2d9574;">"Fred"</span><span style="color: #2d9574;">}</span>
   <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">person</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">name</span> <span style="color: #2d9574;">"Ethel"</span><span style="color: #2d9574;">}</span>
   <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">person</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">name</span> <span style="color: #2d9574;">"Lucy"</span><span style="color: #2d9574;">}</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">person-in-people?</span>
  <span style="color: #6c3163;">[</span>person people<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span>some #<span style="color: #2d9574;">(</span>= person <span style="color: #67b11d;">(</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">person</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">name</span> <span style="color: #715ab1;">%</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> people<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>person-in-people? <span style="color: #2d9574;">"Fred"</span> people<span style="color: #3a81c3;">)</span><span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; true</span>
<span style="color: #3a81c3;">(</span>person-in-people? <span style="color: #2d9574;">"Bob"</span> people<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; nil</span>

</pre>
</div>

<p>
Instead, index the collection according to the parameter which
interests you:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">collected-people</span>
  <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">clojure.set</span>/index people <span style="color: #2d9574;">[</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">person</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">name</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>contains? collected-people <span style="color: #6c3163;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">person</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">name</span> <span style="color: #2d9574;">"Fred"</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span><span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; true</span>
<span style="color: #3a81c3;">(</span>contains? collected-people <span style="color: #6c3163;">{</span><span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">person</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">name</span> <span style="color: #2d9574;">"Bob"</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; false</span>
</pre>
</div>

<p>
This code is readable: "Does <code>collected-people</code> contain a person
who's name is Bob?".
</p>

<p>
You can also index it yourself:
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">index</span>
  <span style="color: #6c3163;">[</span>xs k<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span>reduce
   <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #67b11d;">[</span>m x<span style="color: #67b11d;">]</span>
     <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #b1951d;">[</span>ik <span style="color: #3a81c3;">(</span>get x k<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">]</span>
       <span style="color: #b1951d;">(</span>assoc m ik <span style="color: #3a81c3;">(</span>conj <span style="color: #6c3163;">(</span>get m ik #<span style="color: #2d9574;">{}</span><span style="color: #6c3163;">)</span> x<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{}</span> xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #715ab1;">collected-people</span>
  <span style="color: #6c3163;">(</span>index people <span style="color: #4e3163;">:</span><span style="color: #ba2f59; font-weight: bold;">person</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #4e3163;">name</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>contains? collected-people <span style="color: #2d9574;">"Fred"</span><span style="color: #3a81c3;">)</span><span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; true</span>
<span style="color: #3a81c3;">(</span>contains? collected-people <span style="color: #2d9574;">"Bob"</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; false</span>
</pre>
</div>

<p>
If you repeatedly filter according to certain attributes, you might
want to index according to them, too, with <code>group-by</code> or
<code>clojure.set/index</code>.
</p>

<p>
An important distinction between group-by and index, is that group-by
indexes according to a function, so you can presumably bin values as
well, for example, by age or height, while index works specifically
with keys.
</p>
</div>
</div>
</div>
