org/2020-06-06-code-smells.org
* Filtering

  This problem is similar to a trivial lambda, just wrapped in negation.
  Remember ~remove~ is the negated case of ~filter~:

  #+begin_src clojure
    ;;; Don't                      Do
    (filter #(not (p %)) xs)  =>  (remove p xs)
    (remove #(not (p %)) xs)  =>  (filter p xs)
  #+end_src

* Sequence navigation

  Sometimes you need to dig into elements in a sequence. Plenty of users
  aren't familiar with the concise versions:

  #+begin_src clojure
    ;;; Don't               Do
    (first (first xs)) =>  (ffirst xs)
    (first (next xs))  =>  (fnext xs)
    (next (first xs))  =>  (nfirst xs)
    (next (next xs))   =>  (nnirst xs)
  #+end_src

  Sort of like ~cadr~ but makes more sense.

* Emptiness

  The concept of emptiness is tricky in Clojure. Did you know ~nil~ is
  also empty? What defines an empty sequence? How can we know if a lazy
  unrealized sequence is empty? Do we ~count~ it? What if it's infinite?

  To begin with, let's look at what ~empty?~ actually does:

  #+begin_src clojure
    (defn empty?
      "Returns true if coll has no items - same as (not (seq coll)).
      Please use the idiom (seq x) rather than (not (empty? x))"
      [coll] (not (seq coll)))
  #+end_src

  If you have eyes to see, you notice the docstring and know exactly
  where this is going:

  Don't use ~(not (empty? x))~!

  You've probably seen or written at least one of the following
  examples:

  #+begin_src clojure
    ;;; Don't                        Do
    (when (not (empty? x)) ...)  => (when (seq x) ...)
    (when-not (empty? x) ...)    => (when (seq x) ...)
    (when (= 0 (count x)) ...)   => (when (empty? x) ...)
    (when (< 0 (count x)) ...)   => (when (seq x) ...)
  #+end_src

* Into ~into~

  ~into~ is a pretty useful function, but one often abused.

  The (mis)usage of ~into~ can usually be broken to three distinct
  cases:

** Type Transformations

   #+begin_src clojure
     ;;; Don't           Do
     (into [] xs)   =>  (vec xs)
     (into #{} xs)  =>  (set xs)
   #+end_src

** Map Mapping

   #+begin_src clojure
     ;;; Don't
     (into {} (map (fn [[k v]] [k (f v)]) m))
     (into {} (for [[k v] m] [k (f v)]))
     ;;; Do
     (reduce-kv (fn [m k v] (assoc m k (f v))) {} m)
     ;;; Or faster* but less pretty
     (persistent!
      (reduce-kv (fn [m k v] (assoc! m k (f v))) (transient {}) m))
   #+end_src

   Don't write it out manually every time. Turn it into a function and
   throw it into one of half-dozen util namespaces.

   NOTE: the benefits from the transient version increase with the size
   of the input. For very small maps, the non-transient version is
   faster.

** Not Using The Transducer API

   #+begin_src clojure
     ;;; Don't                       Do
     (into coll (map f xs))     =>  (into coll (map f) xs)
     (into coll (filter p xs))  =>  (into coll (filter p) xs)
   #+end_src

* Working With Maps

