_posts/2020-06-06-code-smells.html

<div id="outline-container-orgbb77d36" class="outline-2">
<h2 id="orgbb77d36">Filtering</h2>
<div class="outline-text-2" id="text-orgbb77d36">
<p>
This problem is similar to a trivial lambda, just wrapped in negation.
Remember <code>remove</code> is the negated case of <code>filter</code>:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't                      Do</span>
<span style="color: #3a81c3;">(</span>filter #<span style="color: #6c3163;">(</span>not <span style="color: #2d9574;">(</span>p <span style="color: #715ab1;">%</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> xs<span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>remove p xs<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>remove #<span style="color: #6c3163;">(</span>not <span style="color: #2d9574;">(</span>p <span style="color: #715ab1;">%</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> xs<span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>filter p xs<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad7ecbe" class="outline-2">
<h2 id="orgad7ecbe">Sequence navigation</h2>
<div class="outline-text-2" id="text-orgad7ecbe">
<p>
Sometimes you need to dig into elements in a sequence. Plenty of users
aren't familiar with the concise versions:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't               Do</span>
<span style="color: #3a81c3;">(</span>first <span style="color: #6c3163;">(</span>first xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> =&gt;  <span style="color: #3a81c3;">(</span>ffirst xs<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>first <span style="color: #6c3163;">(</span>next xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>fnext xs<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>next <span style="color: #6c3163;">(</span>first xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>nfirst xs<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>next <span style="color: #6c3163;">(</span>next xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>   =&gt;  <span style="color: #3a81c3;">(</span>nnext xs<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Sort of like <code>cadr</code> but makes more sense.
</p>
</div>
</div>

<div id="outline-container-org8265f44" class="outline-2">
<h2 id="org8265f44">Emptiness</h2>
<div class="outline-text-2" id="text-org8265f44">
<p>
The concept of emptiness is tricky in Clojure. Did you know <code>nil</code> is
also empty? What defines an empty sequence? How can we know if a lazy
unrealized sequence is empty? Do we <code>count</code> it? What if it's infinite?
</p>

<p>
To begin with, let's look at what <code>empty?</code> actually does:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">empty?</span>
  <span style="color: #da8b55;">"Returns true if coll has no items - same as (not (seq coll)).</span>
<span style="color: #da8b55;">  Please use the idiom (seq x) rather than (not (empty? x))"</span>
  <span style="color: #6c3163;">[</span>coll<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span>not <span style="color: #2d9574;">(</span>seq coll<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
If you have eyes to see, you notice the docstring and know exactly
where this is going:
</p>

<p>
Don't use <code>(not (empty? x))</code>!
</p>

<p>
You've probably seen or written at least one of the following
examples:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't                        Do</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> <span style="color: #6c3163;">(</span>not <span style="color: #2d9574;">(</span>empty? x<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>  =&gt; <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> <span style="color: #6c3163;">(</span>seq x<span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when-not</span> <span style="color: #6c3163;">(</span>empty? x<span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>    =&gt; <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> <span style="color: #6c3163;">(</span>seq x<span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> <span style="color: #6c3163;">(</span>= <span style="color: #4e3163;">0</span> <span style="color: #2d9574;">(</span>count x<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>   =&gt; <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> <span style="color: #6c3163;">(</span>empty? x<span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> <span style="color: #6c3163;">(</span>&lt; <span style="color: #4e3163;">0</span> <span style="color: #2d9574;">(</span>count x<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>   =&gt; <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> <span style="color: #6c3163;">(</span>seq x<span style="color: #6c3163;">)</span> ...<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org73ac902" class="outline-2">
<h2 id="org73ac902">Into <code>into</code></h2>
<div class="outline-text-2" id="text-org73ac902">
<p>
<code>into</code> is a pretty useful function, but one often abused.
</p>

<p>
The (mis)usage of <code>into</code> can usually be broken to three distinct
cases:
</p>
</div>

<div id="outline-container-org6b98cbe" class="outline-3">
<h3 id="org6b98cbe">Type Transformations</h3>
<div class="outline-text-3" id="text-org6b98cbe">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't           Do</span>
<span style="color: #3a81c3;">(</span>into <span style="color: #6c3163;">[]</span> xs<span style="color: #3a81c3;">)</span>   =&gt;  <span style="color: #3a81c3;">(</span>vec xs<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>into #<span style="color: #6c3163;">{}</span> xs<span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>set xs<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9136ae9" class="outline-3">
<h3 id="org9136ae9">Map Mapping</h3>
<div class="outline-text-3" id="text-org9136ae9">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span>into <span style="color: #6c3163;">{}</span> <span style="color: #6c3163;">(</span>map <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #67b11d;">[</span><span style="color: #b1951d;">[</span>k v<span style="color: #b1951d;">]</span><span style="color: #67b11d;">]</span> <span style="color: #67b11d;">[</span>k <span style="color: #b1951d;">(</span>f v<span style="color: #b1951d;">)</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span> m<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>into <span style="color: #6c3163;">{}</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">for</span> <span style="color: #2d9574;">[</span><span style="color: #67b11d;">[</span>k v<span style="color: #67b11d;">]</span> m<span style="color: #2d9574;">]</span> <span style="color: #2d9574;">[</span>k <span style="color: #67b11d;">(</span>f v<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span>reduce-kv <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #2d9574;">[</span>m k v<span style="color: #2d9574;">]</span> <span style="color: #2d9574;">(</span>assoc m k <span style="color: #67b11d;">(</span>f v<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{}</span> m<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Or faster* but less pretty</span>
<span style="color: #3a81c3;">(</span>persistent!
 <span style="color: #6c3163;">(</span>reduce-kv <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #67b11d;">[</span>m k v<span style="color: #67b11d;">]</span> <span style="color: #67b11d;">(</span>assoc! m k <span style="color: #b1951d;">(</span>f v<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>transient <span style="color: #67b11d;">{}</span><span style="color: #2d9574;">)</span> m<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Don't write it out manually every time. Turn it into a function and
throw it into one of half-dozen util namespaces.
</p>

<p>
NOTE: the benefits from the transient version increase with the size
of the input. For very small maps, the non-transient version is
faster.
</p>
</div>
</div>

<div id="outline-container-org5107d38" class="outline-3">
<h3 id="org5107d38">Not Using The Transducer API</h3>
<div class="outline-text-3" id="text-org5107d38">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't                       Do</span>
<span style="color: #3a81c3;">(</span>into coll <span style="color: #6c3163;">(</span>map f xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>     =&gt;  <span style="color: #3a81c3;">(</span>into coll <span style="color: #6c3163;">(</span>map f<span style="color: #6c3163;">)</span> xs<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>into coll <span style="color: #6c3163;">(</span>filter p xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>into coll <span style="color: #6c3163;">(</span>filter p<span style="color: #6c3163;">)</span> xs<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdf1baa7" class="outline-2">
<h2 id="orgdf1baa7">Working With Maps</h2>
<div class="outline-text-2" id="text-orgdf1baa7">
</div>
