org/2020-06-06-code-smells.org
** The Value Of Nothing

   Clojure maps are [[https://www.youtube.com/watch?v=YR5WdGrpoug][collections, not slots]]. Combined with ~nil~'s
   meaning being "nothing", ~nil~ values inside maps are confusing:

   #+begin_src clojure
     (get {:a nil} :a) ;; => nil
     (get {:b 111} :a) ;; => nil
   #+end_src

   Try to avoid inserting ~nil~ values into a map.

   If it is not a map you control, you can always prune it.

   Both implementations are valid:

   #+begin_src clojure
     (defn assoc-some [m k v] (if (nil? v) m (assoc m k v)))
     (defn prune-nils [m] (reduce-kv assoc-some {} m))

     (prune-nils {:a 1 :b nil :c 2 :d nil}) ;; => {:a 1, :c 2}

     (defn remove-nil [m k v] (if (nil? v) (dissoc m k) m))
     (defn prune-nils [m] (reduce-kv remove-nil m m))

     (prune-nils {:a 1 :b nil :c 2 :d nil}) ;; => {:a 1, :c 2}
   #+end_src

** Beware of ~merge~ Where Performance Matters
   
   ~merge~ is clear and easy to work with, but has terrible performance.

   If you're more interested in the performance side of things, watch
   [[https://www.youtube.com/watch?v=3SSHjKT3ZmA][this talk]].
   
   Keep in mind while reading the following sections that using ~merge~
   and ~select-keys~ come at a price. While the general advice is to
   avoid doing things manually, every rule has an exception.
   
   Be aware there are [[https://github.com/bsless/clj-fast][alternatives]] as well, but ~merge~ still performs
   poorly in general.
   
   Thanks to [[https://twitter.com/borkdude][Borkdude]] for highlighting this issue quickly.

** Avoid Manual Merge

   The below piece of code conditionally merges ~m2~ into ~m1~ when the
   values in ~m2~ are not ~nil~:

   #+begin_src clojure
     (let [m1 {}
           m1 (if (nil? (:k m2)) m1 (assoc m1 :k (:k m2)))])
   #+end_src

   Imagine it being done for every key in ~m2~. There can be 20 Keys.
   Who can even make sense of the important parts of the code
   afterwards?

   Instead, combine nil pruning with merge, as two steps of
   understandable data transformations:

   #+begin_src clojure
     (merge m1 (prune-nils m2))
   #+end_src

** Avoid Manual Key Selection

   I see this usually going hand-in-hand with manual merges:

   #+begin_src clojure
     {:a (:a m1)
      :b (:b m2)}
   #+end_src

   Again, this can usually involve pretty big maps. Instead, try to:

   #+begin_src clojure
     (merge (select-keys m1 [:a])
            (select-keys m2 [:b]))
   #+end_src

** Conditional Build-Up

   I often see this pattern repeating itself:

   #+begin_src clojure
     (defn foo
       [in]
       (let [m {:k0 (f0 in)} ;; mandatory
             m (if (p1 in) (assoc m :k1 (f1 in)) m) ;; optional
             m (if (p2 in) (assoc m :k2 (f2 in)) m)]
         m))
   #+end_src

   Instead, use ~cond->~:

   #+begin_src clojure
     (defn foo
       [in]
       (cond-> {:k0 (f0 in)} ;; mandatory
         (p1 in) (assoc :k1 (f1 in)) ;; optional
         (p2 in) (assoc :k2 (f2 in))))
   #+end_src

   This way, flow control turns into syntax and there's no state to keep
   track of.

