_posts/2020-06-06-code-smells.html
<div id="outline-container-org1c69ddd" class="outline-3">
<h3 id="org1c69ddd">The Value Of Nothing</h3>
<div class="outline-text-3" id="text-org1c69ddd">
<p>
Clojure maps are <a href="https://www.youtube.com/watch?v=YR5WdGrpoug">collections, not slots</a>. Combined with <code>nil</code>'s
meaning being "nothing", <code>nil</code> values inside maps are confusing:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>get <span style="color: #6c3163;">{</span><span style="color: #4e3163;">:a</span> <span style="color: #4e3163;">nil</span><span style="color: #6c3163;">}</span> <span style="color: #4e3163;">:a</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; nil</span>
<span style="color: #3a81c3;">(</span>get <span style="color: #6c3163;">{</span><span style="color: #4e3163;">:b</span> <span style="color: #4e3163;">111</span><span style="color: #6c3163;">}</span> <span style="color: #4e3163;">:a</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; nil</span>
</pre>
</div>

<p>
Try to avoid inserting <code>nil</code> values into a map.
</p>

<p>
If it is not a map you control, you can always prune it.
</p>

<p>
Both implementations are valid:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">assoc-some</span> <span style="color: #6c3163;">[</span>m k v<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>nil? v<span style="color: #2d9574;">)</span> m <span style="color: #2d9574;">(</span>assoc m k v<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">prune-nils</span> <span style="color: #6c3163;">[</span>m<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span>reduce-kv assoc-some <span style="color: #2d9574;">{}</span> m<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>prune-nils <span style="color: #6c3163;">{</span><span style="color: #4e3163;">:a</span> <span style="color: #4e3163;">1</span> <span style="color: #4e3163;">:b</span> <span style="color: #4e3163;">nil</span> <span style="color: #4e3163;">:c</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">:d</span> <span style="color: #4e3163;">nil</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; {:a 1, :c 2}</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">remove-nil</span> <span style="color: #6c3163;">[</span>m k v<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>nil? v<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>dissoc m k<span style="color: #2d9574;">)</span> m<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">prune-nils</span> <span style="color: #6c3163;">[</span>m<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span>reduce-kv remove-nil m m<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>prune-nils <span style="color: #6c3163;">{</span><span style="color: #4e3163;">:a</span> <span style="color: #4e3163;">1</span> <span style="color: #4e3163;">:b</span> <span style="color: #4e3163;">nil</span> <span style="color: #4e3163;">:c</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">:d</span> <span style="color: #4e3163;">nil</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; {:a 1, :c 2}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org84e6f66" class="outline-3">
<h3 id="org84e6f66">Beware of <code>merge</code> Where Performance Matters</h3>
<div class="outline-text-3" id="text-org84e6f66">
<p>
<code>merge</code> is clear and easy to work with, but has terrible performance.
</p>

<p>
If you're more interested in the performance side of things, watch
<a href="https://www.youtube.com/watch?v=3SSHjKT3ZmA">this talk</a>.
</p>

<p>
Keep in mind while reading the following sections that using <code>merge</code>
and <code>select-keys</code> comes at a price. While the general advice is to
avoid doing things manually, every rule has an exception.
</p>

<p>
Be aware there are <a href="https://github.com/bsless/clj-fast">alternatives</a> as well, but <code>merge</code> still performs
poorly in general.
</p>

<p>
Thanks to <a href="https://twitter.com/borkdude">Borkdude</a> for highlighting this issue quickly.
</p>
</div>
</div>

<div id="outline-container-org0fccbfe" class="outline-3">
<h3 id="org0fccbfe">Avoid Manual Merge</h3>
<div class="outline-text-3" id="text-org0fccbfe">
<p>
The below piece of code conditionally merges <code>m2</code> into <code>m1</code> when the
values in <code>m2</code> are not <code>nil</code>:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">[</span>m1 <span style="color: #2d9574;">{}</span>
      m1 <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>nil? <span style="color: #b1951d;">(</span><span style="color: #4e3163;">:k</span> m2<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> m1 <span style="color: #67b11d;">(</span>assoc m1 <span style="color: #4e3163;">:k</span> <span style="color: #b1951d;">(</span><span style="color: #4e3163;">:k</span> m2<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Imagine it being done for every key in <code>m2</code>. There can be 20 Keys.
Who can even make sense of the important parts of the code
afterwards?
</p>

<p>
Instead, combine nil pruning with merge, as two steps of
understandable data transformations:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>merge m1 <span style="color: #6c3163;">(</span>prune-nils m2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca8cbfb" class="outline-3">
<h3 id="orgca8cbfb">Avoid Manual Key Selection</h3>
<div class="outline-text-3" id="text-orgca8cbfb">
<p>
I see this usually going hand-in-hand with manual merges:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">{</span><span style="color: #4e3163;">:a</span> <span style="color: #6c3163;">(</span><span style="color: #4e3163;">:a</span> m1<span style="color: #6c3163;">)</span>
 <span style="color: #4e3163;">:b</span> <span style="color: #6c3163;">(</span><span style="color: #4e3163;">:b</span> m2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Again, this can usually involve pretty big maps. Instead, try to:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span>merge <span style="color: #6c3163;">(</span>select-keys m1 <span style="color: #2d9574;">[</span><span style="color: #4e3163;">:a</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span>
       <span style="color: #6c3163;">(</span>select-keys m2 <span style="color: #2d9574;">[</span><span style="color: #4e3163;">:b</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org437be60" class="outline-3">
<h3 id="org437be60">Conditional Build-Up</h3>
<div class="outline-text-3" id="text-org437be60">
<p>
I often see this pattern repeating itself:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">foo</span>
  <span style="color: #6c3163;">[</span>in<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>m <span style="color: #67b11d;">{</span><span style="color: #4e3163;">:k0</span> <span style="color: #b1951d;">(</span>f0 in<span style="color: #b1951d;">)</span><span style="color: #67b11d;">}</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">mandatory</span>
        m <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>p1 in<span style="color: #b1951d;">)</span> <span style="color: #b1951d;">(</span>assoc m <span style="color: #4e3163;">:k1</span> <span style="color: #3a81c3;">(</span>f1 in<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span> m<span style="color: #67b11d;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">optional</span>
        m <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>p2 in<span style="color: #b1951d;">)</span> <span style="color: #b1951d;">(</span>assoc m <span style="color: #4e3163;">:k2</span> <span style="color: #3a81c3;">(</span>f2 in<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span> m<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    m<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Instead, use <code>cond-&gt;</code>:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">foo</span>
  <span style="color: #6c3163;">[</span>in<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">cond-&gt;</span> <span style="color: #2d9574;">{</span><span style="color: #4e3163;">:k0</span> <span style="color: #67b11d;">(</span>f0 in<span style="color: #67b11d;">)</span><span style="color: #2d9574;">}</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">mandatory</span>
    <span style="color: #2d9574;">(</span>p1 in<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>assoc <span style="color: #4e3163;">:k1</span> <span style="color: #67b11d;">(</span>f1 in<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">optional</span>
    <span style="color: #2d9574;">(</span>p2 in<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>assoc <span style="color: #4e3163;">:k2</span> <span style="color: #67b11d;">(</span>f2 in<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
This way, flow control turns into syntax and there's no state to keep
track of.
</p>
</div>
</div>
</div>
