org/2020-06-06-code-smells.org
* Numbers!

  Clojure has functions covering some common use cases when working with
  numbers which both perform and convey intent better.

** Absolute Zero

   #+begin_src clojure
     ;;; Don't     Do
     (= 0 x)  =>  (zero? x)
     (> x 0)  =>  (pos? x)
     (< x 0)  =>  (neg? x)
   #+end_src

** One Away

   #+begin_src clojure
     ;;; Don't     Do
     (+ 1 x)  =>  (inc x)
     (- 1 x)  =>  (dec x)
   #+end_src

* Truth Be Told

  Same case with numbers, no need to compare to booleans and nil.

  #+begin_src clojure
    ;;; Don't          Do
    (= true x)   =>   (true? x)
    (= false x)  =>   (false? x)
    (= nil x)    =>   (nil? x)
  #+end_src

* ~doall~

  ~doall~ is a macro which forcefully realizes lazy sequences. It should
  not be used in production.

  See my previous posts regarding alternative to ~doall~ in a [[https://bsless.github.io/side-effects/][single
  threaded]] and a [[https://bsless.github.io/mapping-parallel-side-effects/][multi-threaded]] context.

  on a side note, I hope you never see something like: ~(doall (doseq [x xs] ..))~.
  It's wrong on two levels
  - ~doseq~ is already strict
  - ~doseq~ returns nothing, so there's nothing to ~doall~

* Style

** Implicit ~do~ blocks

   Some expressions have implicit ~do~ blocks in them, making it
   unnecessary to use a ~do~ block.

*** when

    #+begin_src clojure
      ;;; Don't
      (when test
        (do expr1
            expr2))

      ;;; Do
      (when test
        expr1
        expr2)
    #+end_src

*** let

    #+begin_src clojure
      ;;; Don't
      (let bindings
        (do expr1
            expr2))

      ;;; Do
      (let bindings
        expr1
        expr2)
    #+end_src

*** Function body

    #+begin_src clojure
      ;;; Don't
      (fn []
        (do expr1
            expr2))

      ;;; Do
      (fn []
        expr1
        expr2)
    #+end_src

*** More

    Same goes for ~try~, ~catch~, and any other macro with a type
    signature ~& body~.

** Threading

   Avoid trivial threading:

   #+begin_src clojure
     (-> x f)     => (f x)
     (-> x (f a)) => (f x a)
   #+end_src

   And remember to [[https://stuartsierra.com/2018/07/06/threading-with-style][thread with style]]:

   - ~->~ is for collections
   - ~->>~ is for sequences

*** Thread Instead Of A Deep Call Stack

    Deep call stacks tie implementations together and make testing more
    difficult as the input space becomes larger instead of smaller by
    successive function calls.

    They take atomic and understandable data transformation functions
    and make them opaque.

    #+begin_src clojure
      ;;; Don't
      (defn h [x] ...)
      (defn g [x] ... (h x))
      (defn f [x] ... (g x))

      ;;; Do
      (-> x f g h)
    #+end_src

