_posts/2020-06-06-code-smells.html

<div id="outline-container-orge91b150" class="outline-2">
<h2 id="orge91b150">Numbers!</h2>
<div class="outline-text-2" id="text-orge91b150">
<p>
Clojure has functions covering some common use cases when working with
numbers which both perform and convey intent better.
</p>
</div>

<div id="outline-container-orgc994d2b" class="outline-3">
<h3 id="orgc994d2b">Absolute Zero</h3>
<div class="outline-text-3" id="text-orgc994d2b">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't     Do</span>
<span style="color: #3a81c3;">(</span>= <span style="color: #4e3163;">0</span> x<span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>zero? x<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>&gt; x <span style="color: #4e3163;">0</span><span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>pos? x<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>&lt; x <span style="color: #4e3163;">0</span><span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>neg? x<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org955073f" class="outline-3">
<h3 id="org955073f">One Away</h3>
<div class="outline-text-3" id="text-org955073f">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't     Do</span>
<span style="color: #3a81c3;">(</span>+ <span style="color: #4e3163;">1</span> x<span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>inc x<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>- <span style="color: #4e3163;">1</span> x<span style="color: #3a81c3;">)</span>  =&gt;  <span style="color: #3a81c3;">(</span>dec x<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc6059ba" class="outline-2">
<h2 id="orgc6059ba">Truth Be Told</h2>
<div class="outline-text-2" id="text-orgc6059ba">
<p>
Same case with numbers, no need to compare to booleans and nil.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't          Do</span>
<span style="color: #3a81c3;">(</span>= <span style="color: #4e3163;">true</span> x<span style="color: #3a81c3;">)</span>   =&gt;   <span style="color: #3a81c3;">(</span>true? x<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>= <span style="color: #4e3163;">false</span> x<span style="color: #3a81c3;">)</span>  =&gt;   <span style="color: #3a81c3;">(</span>false? x<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>= <span style="color: #4e3163;">nil</span> x<span style="color: #3a81c3;">)</span>    =&gt;   <span style="color: #3a81c3;">(</span>nil? x<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org18cbca4" class="outline-2">
<h2 id="org18cbca4"><code>doall</code></h2>
<div class="outline-text-2" id="text-org18cbca4">
<p>
<code>doall</code> is a macro which forcefully realizes lazy sequences. It should
not be used in production.
</p>

<p>
See my previous posts regarding alternative to <code>doall</code> in a <a href="https://bsless.github.io/side-effects/">single
threaded</a> and a <a href="https://bsless.github.io/mapping-parallel-side-effects/">multi-threaded</a> context.
</p>

<p>
on a side note, I hope you never see something like: <code>(doall (doseq [x xs] ..))</code>.
It's wrong on two levels
</p>
<ul class="org-ul">
<li><code>doseq</code> is already strict</li>
<li><code>doseq</code> returns nothing, so there's nothing to <code>doall</code></li>
</ul>
</div>
</div>

<div id="outline-container-org9d78621" class="outline-2">
<h2 id="org9d78621">Style</h2>
<div class="outline-text-2" id="text-org9d78621">
</div>
<div id="outline-container-org7ed23eb" class="outline-3">
<h3 id="org7ed23eb">Implicit <code>do</code> blocks</h3>
<div class="outline-text-3" id="text-org7ed23eb">
<p>
Some expressions have implicit <code>do</code> blocks in them, making it
unnecessary to use a <code>do</code> block.
</p>
</div>

<div id="outline-container-orgeac259a" class="outline-4">
<h4 id="orgeac259a">when</h4>
<div class="outline-text-4" id="text-orgeac259a">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> test
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">do</span> expr1
      expr2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when</span> test
  expr1
  expr2<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga61765e" class="outline-4">
<h4 id="orga61765e">let</h4>
<div class="outline-text-4" id="text-orga61765e">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> bindings
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">do</span> expr1
      expr2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> bindings
  expr1
  expr2<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d07f02" class="outline-4">
<h4 id="org2d07f02">Function body</h4>
<div class="outline-text-4" id="text-org2d07f02">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #6c3163;">[]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">do</span> expr1
      expr2<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #6c3163;">[]</span>
  expr1
  expr2<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org25d17fd" class="outline-4">
<h4 id="org25d17fd">More</h4>
<div class="outline-text-4" id="text-org25d17fd">
<p>
Same goes for <code>try</code>, <code>catch</code>, and any other macro with a type
signature <code>&amp; body</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org42519c3" class="outline-3">
<h3 id="org42519c3">Threading</h3>
<div class="outline-text-3" id="text-org42519c3">
<p>
Avoid trivial threading:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;</span> x f<span style="color: #3a81c3;">)</span>     =&gt; <span style="color: #3a81c3;">(</span>f x<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;</span> x <span style="color: #6c3163;">(</span>f a<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> =&gt; <span style="color: #3a81c3;">(</span>f x a<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
And remember to <a href="https://stuartsierra.com/2018/07/06/threading-with-style">thread with style</a>:
</p>

<ul class="org-ul">
<li><code>-&gt;</code> is for collections</li>
<li><code>-&gt;&gt;</code> is for sequences</li>
</ul>
</div>

<div id="outline-container-org6811e64" class="outline-4">
<h4 id="org6811e64">Thread Instead Of A Deep Call Stack</h4>
<div class="outline-text-4" id="text-org6811e64">
<p>
Deep call stacks tie implementations together and make testing more
difficult as the input space becomes larger instead of smaller by
successive function calls.
</p>

<p>
They take atomic and understandable data transformation functions
and make them opaque.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">h</span> <span style="color: #6c3163;">[</span>x<span style="color: #6c3163;">]</span> ...<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">g</span> <span style="color: #6c3163;">[</span>x<span style="color: #6c3163;">]</span> ... <span style="color: #6c3163;">(</span>h x<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">f</span> <span style="color: #6c3163;">[</span>x<span style="color: #6c3163;">]</span> ... <span style="color: #6c3163;">(</span>g x<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;</span> x f g h<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
