org/2020-06-06-code-smells.org
*** ~some->~

    Nested when/let can be converted to ~some->~

    #+begin_src clojure
      ;;; Don't
      (when-let [x1 (f0 x0)]
        (when-let [x2 (f1 x1)]
          (when-let [x3 (f2 x2)]
            (f3 x3))))

      ;;; Do
      (some-> x0 f0 f1 f2 f3)
    #+end_src

    Same goes for this structure:

    #+begin_src clojure
      ;;; Don't
      (let [x (if (nil? x) nil (x f0))
            x (if (nil? x) nil (x f1))
            x (if (nil? x) nil (x f2))]
        (if (nil? x) nil (f3 x)))

      ;;; Do
      (some-> x0 f0 f1 f2 f3)
    #+end_src

*** ~cond->~

    #+begin_src clojure
      (let [x (if (p0 x) (f0 x) x)
            x (if (p1 x) (f1 x) x)]
        (if (p2 x) (f2 x) x))
    #+end_src

    #+begin_src clojure
      (cond-> x
        (p0 x) f0
        (p1 x) f1
        (p2 x) f2)
    #+end_src

    The only subtle difference to keep in mind that the predicates can't
    depend on the result of the previous computation stage.

    We can achieve that behavior with a slight modification to ~cond->~:

    #+begin_src clojure
      (defmacro cond*->
        [expr & clauses]
        (assert (even? (count clauses)))
        (let [g (gensym)
              steps (map (fn [[test step]] `(if (-> ~g ~test) (-> ~g ~step) ~g))
                         (partition 2 clauses))]
          `(let [~g ~expr
                 ~@(interleave (repeat g) (butlast steps))]
             ~(if (empty? steps)
                g
                (last steps)))))

      (cond*-> x
               p0 f0
               p1 f1
               p2 f2)
    #+end_src

*** ~let~ Shadowing

    There's usually very little reason to shadow a binding inside a ~let~ body:

    #+begin_src clojure
      (let [x (f0 x)
            x (f1 x)
            x (f2 x)]
        (f3 x))
    #+end_src

    Should be:

    #+begin_src clojure
      (-> x f0 f1 f2 f3)
    #+end_src

** Nested Forms

   Plenty of macros with binding forms don't need to be nested:

   #+begin_src clojure
     ;;; Don't
     (let [x 1]
       (let [y 2]
         [x y]))

     ;; Do
     (let [x 1
           y 2]
       [x y])
   #+end_src

   A special case is that of nested iteration:

   #+begin_src clojure
     ;;; Don't
     (doseq [x xs]
       (doseq [y ys]
         (println x y)))

     ;;; Do
     (doseq [x xs
             y ys]
       (println x y))
   #+end_src

