_posts/2020-06-06-code-smells.html

<div id="outline-container-org9e8d94e" class="outline-4">
<h4 id="org9e8d94e"><code>some-&gt;</code></h4>
<div class="outline-text-4" id="text-org9e8d94e">
<p>
Nested when/let can be converted to <code>some-&gt;</code>
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">when-let</span> <span style="color: #6c3163;">[</span>x1 <span style="color: #2d9574;">(</span>f0 x0<span style="color: #2d9574;">)</span><span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">when-let</span> <span style="color: #2d9574;">[</span>x2 <span style="color: #67b11d;">(</span>f1 x1<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">when-let</span> <span style="color: #67b11d;">[</span>x3 <span style="color: #b1951d;">(</span>f2 x2<span style="color: #b1951d;">)</span><span style="color: #67b11d;">]</span>
      <span style="color: #67b11d;">(</span>f3 x3<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span>some-&gt; x0 f0 f1 f2 f3<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Same goes for this structure:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">[</span>x <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>nil? x<span style="color: #67b11d;">)</span> <span style="color: #4e3163;">nil</span> <span style="color: #67b11d;">(</span>x f0<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
      x <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>nil? x<span style="color: #67b11d;">)</span> <span style="color: #4e3163;">nil</span> <span style="color: #67b11d;">(</span>x f1<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
      x <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>nil? x<span style="color: #67b11d;">)</span> <span style="color: #4e3163;">nil</span> <span style="color: #67b11d;">(</span>x f2<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>nil? x<span style="color: #2d9574;">)</span> <span style="color: #4e3163;">nil</span> <span style="color: #2d9574;">(</span>f3 x<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span>some-&gt; x0 f0 f1 f2 f3<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d24401" class="outline-4">
<h4 id="org3d24401"><code>cond-&gt;</code></h4>
<div class="outline-text-4" id="text-org3d24401">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">[</span>x <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>p0 x<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>f0 x<span style="color: #67b11d;">)</span> x<span style="color: #2d9574;">)</span>
      x <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>p1 x<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>f1 x<span style="color: #67b11d;">)</span> x<span style="color: #2d9574;">)</span><span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>p2 x<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>f2 x<span style="color: #2d9574;">)</span> x<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">cond-&gt;</span> x
  <span style="color: #6c3163;">(</span>p0 x<span style="color: #6c3163;">)</span> f0
  <span style="color: #6c3163;">(</span>p1 x<span style="color: #6c3163;">)</span> f1
  <span style="color: #6c3163;">(</span>p2 x<span style="color: #6c3163;">)</span> f2<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
The only subtle difference to keep in mind that the predicates can't
depend on the result of the previous computation stage.
</p>

<p>
We can achieve that behavior with a slight modification to <code>cond-&gt;</code>:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defmacro</span> <span style="color: #6c3163; font-weight: bold;">cond*-&gt;</span>
  <span style="color: #6c3163;">[</span>expr &amp; clauses<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span>assert <span style="color: #2d9574;">(</span>even? <span style="color: #67b11d;">(</span>count clauses<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>g <span style="color: #67b11d;">(</span>gensym<span style="color: #67b11d;">)</span>
        steps <span style="color: #67b11d;">(</span>map <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">fn</span> <span style="color: #3a81c3;">[</span><span style="color: #6c3163;">[</span>test step<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">]</span> `<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;</span> ~g ~test<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;</span> ~g ~step<span style="color: #6c3163;">)</span> ~g<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span>
                   <span style="color: #b1951d;">(</span>partition <span style="color: #4e3163;">2</span> clauses<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    `<span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #67b11d;">[</span>~g ~expr
           ~@<span style="color: #b1951d;">(</span>interleave <span style="color: #3a81c3;">(</span>repeat g<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span>butlast steps<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">]</span>
       ~<span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>empty? steps<span style="color: #b1951d;">)</span>
          g
          <span style="color: #b1951d;">(</span>last steps<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>cond*-&gt; x
         p0 f0
         p1 f1
         p2 f2<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org20f9e67" class="outline-4">
<h4 id="org20f9e67"><code>let</code> Shadowing</h4>
<div class="outline-text-4" id="text-org20f9e67">
<p>
There's usually very little reason to shadow a binding inside a <code>let</code> body:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">[</span>x <span style="color: #2d9574;">(</span>f0 x<span style="color: #2d9574;">)</span>
      x <span style="color: #2d9574;">(</span>f1 x<span style="color: #2d9574;">)</span>
      x <span style="color: #2d9574;">(</span>f2 x<span style="color: #2d9574;">)</span><span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span>f3 x<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Should be:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">-&gt;</span> x f0 f1 f2 f3<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8428b4c" class="outline-3">
<h3 id="org8428b4c">Nested Forms</h3>
<div class="outline-text-3" id="text-org8428b4c">
<p>
Plenty of macros with binding forms don't need to be nested:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">[</span>x <span style="color: #4e3163;">1</span><span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>y <span style="color: #4e3163;">2</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">[</span>x y<span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">[</span>x <span style="color: #4e3163;">1</span>
      y <span style="color: #4e3163;">2</span><span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">[</span>x y<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
A special case is that of nested iteration:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Don't</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">doseq</span> <span style="color: #6c3163;">[</span>x xs<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">doseq</span> <span style="color: #2d9574;">[</span>y ys<span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">(</span>println x y<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Do</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">doseq</span> <span style="color: #6c3163;">[</span>x xs
        y ys<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">(</span>println x y<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
