org/2020-06-06-code-smells.org
** Trivial Mapping Wrappers
   
   We can sometimes find the following form in code, of do-one-thing
   then do-one-thing-n-times:
   
   #+begin_src clojure
     (defn build-person [x] ...)
     (defn build-persons [xs] (map build-person xs))
   #+end_src
   
   It may not be immediately apparent why it's a code smell.

   - It ties implementation to concretion. Now the entire code will be
     in the context of a sequence of things and not thinking about one
     thing at a time. We have to mentally jump back and forth between
     the collection of things and one thing.
   - Fragile: we might end up adding more logic to ~build-persons~,
     which makes us nominative liars, since the name doesn't match what
     it does anymore. This change now won't be reflected across the
     system by anyone using only the singular function.
   - Composes badly: had we wanted to compose several singular
     functions, we could have just used a threading macro or ~comp~ and
     be done with it. To compose for a sequential use case we could have
     used transducers. Now we are tied to a sequential concretion.
   - Less reusable: due to all of the above, once a singular function
     has been dragged to the plural context, we decrease the chances of
     being able to reuse the singular from one side, and tie the plural
     down with further details which prevent usage in other contexts, or
     would necessitate ugly hacks, like mapping it on a sequence with
     one element.


** Positional Arguments

*** Avoid An Explosion In Input Arguments
    
    If your functions take a very large number of arguments, suspect
    they should be broken apart, because it's unlikely all arguments are
    used simultaneously.
    
    #+begin_src clojure
      (defn f
        [fizz buzz foo bar quux ohgod enough])
    #+end_src

*** Prefer A map To Key-Value Rest Arguments

    #+begin_src clojure
      (defn f
        ([x y]
         (f x y :a 1 :b 2))
        ([x y & {a :a b :b}]
         ,,,))

      (f x y :a 3 :b 4)

      ;;; vs.

      (defn f
        ([x y]
         (f x y {:a 1 :b 2}))
        ([x y {a :a b :b}]
        ,,,))

      (f x y {:a 3 :b 4})
    #+end_src
    
    The main reason for this is when you wish to pass the function
    around as a higher order function you need to be mindful of the type
    of the tail arguments, make sure they always get unpacked, and
    remember to usually ~apply~ everywhere. This is easily avoided by
    using the second style.

*** Prefer Returning Maps Over Returning Positional Values
    
    Using positional return values encodes meaning to indices, giving
    semantic or business meaning to indices/ordering. It's better to
    encode that meaning as explicit keywords:
    
    #+begin_src clojure
      (defn sieve
        [p xs]
        [(filter p xs) (remove p xs)])

      (first (sieve even? (range 9)))
      ;; => (0 2 4 6 8)

      ;;; vs.

      (defn sieve
        [p xs]
        {:true (filter p xs) :false (remove p xs)})

      (:true (sieve even? (range 9)))
      ;; => (0 2 4 6 8)
    #+end_src

* Afterword

  This post and my advice are clearly opinionated. If you disagree with
  anything I've said, found a mistake, or think I missed important bits,
  feel free to shout at me on any of the social media platforms I'm on.
