_posts/2020-06-06-code-smells.html

<div id="outline-container-orgf89ba71" class="outline-3">
<h3 id="orgf89ba71">Trivial Mapping Wrappers</h3>
<div class="outline-text-3" id="text-orgf89ba71">
<p>
We can sometimes find the following form in code, of do-one-thing
then do-one-thing-n-times:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">build-person</span> <span style="color: #6c3163;">[</span>x<span style="color: #6c3163;">]</span> ...<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">build-persons</span> <span style="color: #6c3163;">[</span>xs<span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span>map build-person xs<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
It may not be immediately apparent why it's a code smell.
</p>

<ul class="org-ul">
<li>It ties implementation to concretion. Now the entire code will be
in the context of a sequence of things and not thinking about one
thing at a time. We have to mentally jump back and forth between
the collection of things and one thing.</li>
<li>Fragile: we might end up adding more logic to <code>build-persons</code>,
which makes us nominative liars, since the name doesn't match what
it does anymore. This change now won't be reflected across the
system by anyone using only the singular function.</li>
<li>Composes badly: had we wanted to compose several singular
functions, we could have just used a threading macro or <code>comp</code> and
be done with it. To compose for a sequential use case we could have
used transducers. Now we are tied to a sequential concretion.</li>
<li>Less reusable: due to all of the above, once a singular function
has been dragged to the plural context, we decrease the chances of
being able to reuse the singular from one side, and tie the plural
down with further details which prevent usage in other contexts, or
would necessitate ugly hacks, like mapping it on a sequence with
one element.</li>
</ul>
</div>
</div>


<div id="outline-container-org23c637e" class="outline-3">
<h3 id="org23c637e">Positional Arguments</h3>
<div class="outline-text-3" id="text-org23c637e">
</div>
<div id="outline-container-org803559c" class="outline-4">
<h4 id="org803559c">Avoid An Explosion In Input Arguments</h4>
<div class="outline-text-4" id="text-org803559c">
<p>
If your functions take a very large number of arguments, suspect
they should be broken apart, because it's unlikely all arguments are
used simultaneously.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">f</span>
  <span style="color: #6c3163;">[</span>fizz buzz foo bar quux ohgod enough<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd914ae" class="outline-4">
<h4 id="orgfd914ae">Prefer A map To Key-Value Rest Arguments</h4>
<div class="outline-text-4" id="text-orgfd914ae">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">f</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>x y<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span>f x y <span style="color: #4e3163;">:a</span> <span style="color: #4e3163;">1</span> <span style="color: #4e3163;">:b</span> <span style="color: #4e3163;">2</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>x y &amp; <span style="color: #67b11d;">{</span>a <span style="color: #4e3163;">:a</span> b <span style="color: #4e3163;">:b</span><span style="color: #67b11d;">}</span><span style="color: #2d9574;">]</span>
   ,,,<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>f x y <span style="color: #4e3163;">:a</span> <span style="color: #4e3163;">3</span> <span style="color: #4e3163;">:b</span> <span style="color: #4e3163;">4</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">vs.</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">f</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>x y<span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span>f x y <span style="color: #67b11d;">{</span><span style="color: #4e3163;">:a</span> <span style="color: #4e3163;">1</span> <span style="color: #4e3163;">:b</span> <span style="color: #4e3163;">2</span><span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #2d9574;">[</span>x y <span style="color: #67b11d;">{</span>a <span style="color: #4e3163;">:a</span> b <span style="color: #4e3163;">:b</span><span style="color: #67b11d;">}</span><span style="color: #2d9574;">]</span>
  ,,,<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>f x y <span style="color: #6c3163;">{</span><span style="color: #4e3163;">:a</span> <span style="color: #4e3163;">3</span> <span style="color: #4e3163;">:b</span> <span style="color: #4e3163;">4</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
The main reason for this is when you wish to pass the function
around as a higher order function you need to be mindful of the type
of the tail arguments, make sure they always get unpacked, and
remember to usually <code>apply</code> everywhere. This is easily avoided by
using the second style.
</p>
</div>
</div>

<div id="outline-container-orgc0dcc71" class="outline-4">
<h4 id="orgc0dcc71">Prefer Returning Maps Over Returning Positional Values</h4>
<div class="outline-text-4" id="text-orgc0dcc71">
<p>
Using positional return values encodes meaning to indices, giving
semantic or business meaning to indices/ordering. It's better to
encode that meaning as explicit keywords:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">sieve</span>
  <span style="color: #6c3163;">[</span>p xs<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">[</span><span style="color: #2d9574;">(</span>filter p xs<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>remove p xs<span style="color: #2d9574;">)</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span>first <span style="color: #6c3163;">(</span>sieve even? <span style="color: #2d9574;">(</span>range <span style="color: #4e3163;">9</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; (0 2 4 6 8)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">vs.</span>

<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defn</span> <span style="color: #6c3163; font-weight: bold;">sieve</span>
  <span style="color: #6c3163;">[</span>p xs<span style="color: #6c3163;">]</span>
  <span style="color: #6c3163;">{</span><span style="color: #4e3163;">:true</span> <span style="color: #2d9574;">(</span>filter p xs<span style="color: #2d9574;">)</span> <span style="color: #4e3163;">:false</span> <span style="color: #2d9574;">(</span>remove p xs<span style="color: #2d9574;">)</span><span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">:true</span> <span style="color: #6c3163;">(</span>sieve even? <span style="color: #2d9574;">(</span>range <span style="color: #4e3163;">9</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; (0 2 4 6 8)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgca7e66d" class="outline-2">
<h2 id="orgca7e66d">Afterword</h2>
<div class="outline-text-2" id="text-orgca7e66d">
<p>
This post and my advice are clearly opinionated. If you disagree with
anything I've said, found a mistake, or think I missed important bits,
feel free to shout at me on any of the social media platforms I'm on.
</p>
</div>
</div>
